Repository: Itai-Lukio/lukio_favorites_plugin
Catalog: lukio-favorites-plugin/languages/lukio-favorites-plugin-*.po
Languages: he_il

source: General options
he_il: אפשרויות כלליות

source: Button options
he_il: אפשרויות כפתור

source: Menu options
he_il: אפשרויות תפריט

source: Extra css
he_il: אקסטרה css

source: Info
he_il: מידע

source: Save Settings
he_il: שמור הגדרות

source: Add text
he_il: טקסט הוספה

source: Remove text
he_il: טקסט הסרה

source: Image when not in favorites
he_il: תמונה כשלא במועדפים

source: Image when in favorites
he_il: תמונה כשבמועדפים

source: Use text button
he_il: כפתור טקסט

source: Use custom image
he_il: השתמש בתמונה מתואמת

source: Favorites page
he_il: עמוד מועדפים

source: Add Button to post title
he_il: הוספת כפתור לכותרת הפוסט

# $s is a placeholder to place the tab translated name later on
source: The button settings are managed in the "%s" tab.
he_il: אפשרויות הכפתור מנוהלות בלשונית "%s".

# %s is for placing link for wp "the loop" explanation
source: The base shortcode for the favorites button to place the button freely and using its basic settings. Use the global post to be its target to be marked in favorites or the current post when used in side %s.
he_il: השורטקוד הבסיס של כפתור המועדפים לאפשר מיקום חופשי של הכפתור. משתמש בפוסט הגלובלי להיות היעד של פעולות הכפתור או שמשתמש בפוסט הנוכחי כאשר נמצאים בתוך ה%s.

# %s is for placing link for wp "the loop" explanation
source: Can specify a post id to be the target to be maked in favorites, usefull to have full control of the button target with out being reliance on %s or the global post.
he_il: ניתן לספק מספר מזהה לפוסט שיהיה היעד של הכפתור, שימושי לצורך שליטה מלאה על היעד של הכפתור בלי תלות ב%s או בפוסט הגלובאלי.

source: Allow to add custom class string to be added to favorites buttons. when you need just a bit more control to have different style or scripts to be added to different buttons in the site.
he_il: מאפשר להוסיף קלאס מתואם שיתווסף לכפתור המועדפים. כאשר צריך טיפה יותר שליטה על עיצוב או סקריפטים שיתווספו לכפתורים שונים ברחבי האתר.

source: Favorites button
he_il: כפתור מועדפים

source: Base shortcode
he_il: שורטקוד בסיסי

source: Menu button title
he_il: כותרת כפתור תפריט

source: Image when favorites are empty
he_il: תמונה שהמועדפים ריק

source: Image when favorites are not empty
he_il: תמונה שהמועדפים לא ריק

source: Add favorites button to menu
he_il: הוספת כפתור מועדפים לתפריט

source: Menu to add button to
he_il: תפריט להוסיף אליו את הכפתור

source: Select menu
he_il: בחירת תפריט

source: Place favorites button at the start of the menu
he_il: מיקום כפתור מועדפים בתחילת התפריט

source: Pick image
he_il: בחר תמונה

source: Preview of the button
he_il: תצוגה מוקדמת של הכפתור

source: Button width
he_il: רוחב הכפתור

source: Button height
he_il: גובה הכפתור

source: Select button icon
he_il: בחירת אייקון לכפתור

source: Saving empty field will go back to the current language default, if supported
he_il: שמירת שדות ריקים יחזיר לבררת המחדל של השפה הנוכחית, אם היא נתמכת

source: Heart
he_il: לב

source: Star
he_il: כוכב

source: Lukio favorites
he_il: לוקיו מועדפים

source: Add to favorites
he_il: הוספה למועדפים

source: Remove from favorites
he_il: הסרה מהמועדפים

source: Favorites
he_il: מועדפים

source: Remove "%s" from favorites
he_il: הסרה של "%s" מהמועדפים

source: Add "%s" to favorites
he_il: הוספה של "%s" מהמועדפים

source: Settings
he_il: הגדרות

source: Nothing was saved to favorites yet
he_il: עדין לא נשמרו מועדפים

source: Read More
he_il: קרא עוד

source: Itai Dotan @Lukio
he_il: איתי דותן @לוקיו

source: Lukio Favorites Plugin
he_il: לוקיו תוסף מועדפים

source: Favorites plugin to simply allow users to mark as favorite any post type selected in the plugin options
he_il: תוסף מועדפים שמאפשר למשתמשים בקלות לשמור למועדפים כל סוג פוסט שהוגדר בהגדרות התוסף
